# Veri Seçme ve İndeksleme
 Veri Seçme ve İndeksleme, pandas kütüphanesini kullanarak veri çerçevelerindeki belirli verilere erişme ve bu verileri işleme sürecini ifade eder.

In [1]:
import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 22, 28],
        'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']}

df = pd.DataFrame(data)

In [2]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   22      Chicago
3    David   28      Houston

### Veri Seçme ve İndeksleme işlemleri
##### 1. Sütun Seçme:

In [3]:
df['Age']

0    25
1    30
2    22
3    28
Name: Age, dtype: int64

**2. Birden Fazla Sütun Seçme:**

In [4]:
df[['Name', 'City']]

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago
3    David      Houston

##### 2. Satır Seçme: 
Satır Numarasına Göre Seçme

In [5]:
df.iloc[1]  # İkinci satırı seçer

Name            Bob
Age              30
City    Los Angeles
Name: 1, dtype: object

Belirli Satırları Dilimleme (Slicing):

In [6]:
df.iloc[1:4]  # 1. satırdan 3. satıra kadar olan satırları seçer

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   22      Chicago
3    David   28      Houston

**3.Koşullu İndeksleme:**

In [7]:
df[df['Age'] >= 25]  # Yaşı 25 ve üstü olanları seçer

    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles
3  David   28      Houston

**4.Etiket (Label) İndeksleme:**
- Özel İndeks Belirleme: 
Bir sütunu indeks olarak belirlemek için set_index metodunu kullanabilirsiniz.

In [8]:
df.set_index('Name')

         Age         City
Name
Alice     25     New York
Bob       30  Los Angeles
Charlie   22      Chicago
David     28      Houston

**5.Yeniden İndeksleme:**
- Varolan bir indeksi değiştirerek DataFrame'inizi yeniden düzenleyebilirsiniz.

In [9]:
new_index = ['A', 'B', 'C', 'D'] 
df.index =new_index
df

      Name  Age         City
A    Alice   25     New York
B      Bob   30  Los Angeles
C  Charlie   22      Chicago
D    David   28      Houston